# Introduction to Pandas

In this section of the course we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features.


* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

# >Series


A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

In [1]:
import numpy as np
import pandas as pd

You can convert a list,numpy array, or dictionary to a Series:

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
ser = pd.Series([1,2,5,4],index = ['A', 'B','C', 'D'])
ser

A    1
B    2
C    5
D    4
dtype: int64

In [11]:
ser['B']

2

# >DataFrames

We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [12]:
from numpy.random import randn

In [13]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [14]:
df

          W         X         Y         Z
A -1.343876 -0.323520 -0.019527 -0.049276
B  1.040922 -1.401306 -0.398240  1.022033
C  1.010877 -0.212955 -0.930846  1.548947
D -1.551710 -1.175462  0.865800  0.644047
E -0.346429  1.076151 -0.497280 -3.157157

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [15]:
df['W']

A   -1.343876
B    1.040922
C    1.010877
D   -1.551710
E   -0.346429
Name: W, dtype: float64

In [16]:
df[['W','Z']]

          W         Z
A -1.343876 -0.049276
B  1.040922  1.022033
C  1.010877  1.548947
D -1.551710  0.644047
E -0.346429 -3.157157

In [17]:
df['new'] = df['W'] + df['Y'] # Creating new column

In [18]:
df

          W         X         Y         Z       new
A -1.343876 -0.323520 -0.019527 -0.049276 -1.363403
B  1.040922 -1.401306 -0.398240  1.022033  0.642681
C  1.010877 -0.212955 -0.930846  1.548947  0.080031
D -1.551710 -1.175462  0.865800  0.644047 -0.685910
E -0.346429  1.076151 -0.497280 -3.157157 -0.843709

In [20]:
df.drop('new',axis=1) # Removing a column, not inplace

          W         X         Y         Z
A -1.343876 -0.323520 -0.019527 -0.049276
B  1.040922 -1.401306 -0.398240  1.022033
C  1.010877 -0.212955 -0.930846  1.548947
D -1.551710 -1.175462  0.865800  0.644047
E -0.346429  1.076151 -0.497280 -3.157157

In [21]:
df

          W         X         Y         Z       new
A -1.343876 -0.323520 -0.019527 -0.049276 -1.363403
B  1.040922 -1.401306 -0.398240  1.022033  0.642681
C  1.010877 -0.212955 -0.930846  1.548947  0.080031
D -1.551710 -1.175462  0.865800  0.644047 -0.685910
E -0.346429  1.076151 -0.497280 -3.157157 -0.843709

In [22]:
df.drop('new',axis=1,inplace=True)

In [23]:
df

          W         X         Y         Z
A -1.343876 -0.323520 -0.019527 -0.049276
B  1.040922 -1.401306 -0.398240  1.022033
C  1.010877 -0.212955 -0.930846  1.548947
D -1.551710 -1.175462  0.865800  0.644047
E -0.346429  1.076151 -0.497280 -3.157157

In [25]:
df.drop('E',axis=0) # Removing a row

          W         X         Y         Z
A -1.343876 -0.323520 -0.019527 -0.049276
B  1.040922 -1.401306 -0.398240  1.022033
C  1.010877 -0.212955 -0.930846  1.548947
D -1.551710 -1.175462  0.865800  0.644047

** Selecting Rows**

In [26]:
df.loc['A']

W   -1.343876
X   -0.323520
Y   -0.019527
Z   -0.049276
Name: A, dtype: float64

In [27]:
df.iloc[2]

W    1.010877
X   -0.212955
Y   -0.930846
Z    1.548947
Name: C, dtype: float64

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [29]:
df

          W         X         Y         Z
A -1.343876 -0.323520 -0.019527 -0.049276
B  1.040922 -1.401306 -0.398240  1.022033
C  1.010877 -0.212955 -0.930846  1.548947
D -1.551710 -1.175462  0.865800  0.644047
E -0.346429  1.076151 -0.497280 -3.157157

In [30]:
df[df['W']>0]

          W         X         Y         Z
B  1.040922 -1.401306 -0.398240  1.022033
C  1.010877 -0.212955 -0.930846  1.548947

In [31]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.398240 -1.401306
C -0.930846 -0.212955

# >Missing Data

 Dealing with Missing Data is very important in case of machine learning. Using pandas we can:

In [32]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [33]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [34]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [35]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [36]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [37]:
df['A'].fillna(value=df['A'].mean())  # Generally replace missing values with column mean

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# >Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [38]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [39]:
df = pd.DataFrame(data)

In [40]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [41]:
df.groupby('Company')

In [42]:
by_comp = df.groupby("Company")

You can save this object as a new variable:
And then call aggregate methods off the object:

In [43]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [44]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [45]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [46]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# >Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating.

In [47]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [48]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [49]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [50]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [51]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [52]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Dimensions should match along the axis you are concatenating on.

In [53]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [54]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [55]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [56]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [57]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [58]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [59]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [60]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [61]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# >Operations

In [62]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [63]:
df['col2'].unique()

array([444, 555, 666])

In [64]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [65]:
newdf

   col1  col2 col3
3     4   444  xyz

In [66]:
def times2(x):
    return x*2

In [67]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [68]:
del df['col1']

In [69]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [71]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [72]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

# >Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

## CSV

In [76]:
df = pd.read_csv('data/example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [83]:
df.to_csv('data/example',index=False)

## Excel

In [84]:
pd.read_excel('data/Excel_Sample.xlsx',sheetname='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [85]:
df.to_excel('data/Excel_Sample.xlsx',sheet_name='Sheet1')